// Needed for string functions
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdarg.h>

#include <JRSMemory.h>
#include <JRSMemory_Thread.h>
#include <JRSMemory_Pools.h>
#include "JRSMemory_ErrorCodes.h"
#include "JRSMemory_Internal.h"

// Extern the main thread
extern cJRSThread::jrs_threadout JRSMemory_LiveViewThread(cJRSThread::jrs_threadin pArg);

// Inline defines
#define HEAP_FULLSIZE_CALC(x, min) (x > min ? ((x + 0xf) & ~(0xf)) : min)

// Elephant namespace.  using Elephant declared in JRSMemory.h.
namespace Elephant
{
	// Global memory manager construction.  Put here to enable constructor reordering.
#ifdef JRSMEMORYGLOBALDECLARATION
	// Define and recompile if you want a global somewhere. The reason it isn't is because there
	// is no way to make it initialize first for all compilers.  This means doing it statically
	// is more generic at minimal cost.
	cMemoryManager g_MemoryManager;

	cMemoryManager &cMemoryManager::Get(void)
	{
		return g_MemoryManager;
	}
#endif

	// Global callbacks
	MemoryManagerTTYOutputCB cMemoryManager::m_MemoryManagerTTYOutput = 0;
	MemoryManagerErrorCB  cMemoryManager::m_MemoryManagerError = 0;
	MemoryManagerOutputToFile cMemoryManager::m_MemoryManagerFileOutput = 0;
	MemoryManagerOutputToFile cMemoryManager::m_MemoryManagerLiveViewOutput = MemoryManagerLiveViewTransfer;
	MemoryManagerDefaultAllocator cMemoryManager::m_MemoryManagerDefaultAllocator = MemoryManagerDefaultSystemAllocator;

					(jrs_u64)3,
					(jrs_u64)4,
					(jrs_u64)5,
					(jrs_u64)6,
					(jrs_u64)7
					);
			}
		}
		else 
		{
			MemoryWarning(0, JRSMEMORYERROR_UNKNOWNWARNING, "Wrong type for ContinuousLogging_PoolOperation.");
		}

		// Add the data
		ContinuousLog_AddToBuffer(op, pAddress);

		// Add the data
		// Write CSV file if need be
		if(m_bEnableContinuousDump && m_MemoryManagerFileOutput)
			m_MemoryManagerFileOutput(ContinuousOutputText, (int)strlen(ContinuousOutputText), m_ContinuousDumpFile, bFileAppend);

		// Unlock the continuous writes
		m_ContThreadLock.Unlock();
#endif
	}

	//  Description:
	//		Internal only.  Reports if the heap can log or not.
	//  See Also:
	//		
	//  Arguments:
	//		pHeap - Heap to check.
	//  Return Value:
	//      Nothing
	//  Summary:	
	//		Checks if the heap can log or not
	jrs_bool cMemoryManager::ContinuousLog_CanLog(cHeap *pHeap)
	{
#ifndef MEMORYMANAGER_MINIMAL
		// Only if active
		if(!pHeap->IsLoggingEnabled())
			return FALSE;

		// Only if continuous data grabbing is enabled or we want continuous output
		if(!m_bELVContinuousGrab && !m_bEnableContinuousDump)
			return FALSE;
#endif
		return TRUE;
	}

	//  Description:
	//		Internal only.  Reports if the NI heap can log or not.
	//  See Also:
	//		
	//  Arguments:
	//		pHeap - Heap to check.
	//  Return Value:
	//      Nothing
	//  Summary:	
	//		Checks if the NI heap can log or not
	jrs_bool cMemoryManager::ContinuousLog_CanLog(cHeapNonIntrusive *pHeap)
	{
#ifndef MEMORYMANAGER_MINIMAL
		// Only if active
		if(!pHeap->IsLoggingEnabled())
			return FALSE;

		// Only if continuous data grabbing is enabled or we want continuous output
		if(!m_bELVContinuousGrab && !m_bEnableContinuousDump)
			return FALSE;
#endif
		return TRUE;
	}

	//  Description:
	//		Internal only.  This function add data to the internal ring buffer of operations to be transmitted.  This specific function deals with 
	//		the heap operations.
	//  See Also:
	//		
	//  Arguments:
	//		eType - Type of Logging operation.
	//		pHeap - Heap pointer.
	//		pPool - Pool pointer base.
	//		uMisc - Misc information.
	//  Return Value:
	//      Nothing
	//  Summary:	
	//		Reports any operations that occur on a specific heap.  These cover Allocations, Frees and Reallocs.  Reallocs may not always show.
	void cMemoryManager::ContinuousLogging_Operation(eContLog eType, cHeap *pHeap, cPoolBase *pPool, jrs_u64 uMisc)
	{
#ifndef MEMORYMANAGER_MINIMAL
		// Only if active - we ignore the heap here and only care about if we should be logging or not
		if(!m_bELVContinuousGrab && !m_bEnableContinuousDump)
			return;

		// Lock the thread writes
		m_ContThreadLock.Lock();

		jrs_bool bFileAppend = TRUE;
		jrs_i8 ContinuousOutputText[512];

		sLVOperation op;
		op.type = (jrs_u8)eType;
		op.address = 0;
		op.sizeofopdata = 32;
		op.alignment = 0;
		op.extraInfo0 = op.extraInfo1 = op.extraInfo2 = op.extraInfo3 = 0;
		if(eType == eContLog_CreateHeap || eType == eContLog_DestroyHeap || eType == eContLog_ResizeHeap)
		{	
			struct LVOpHeapInformation
			{
				jrs_u64 uSize;				// 0
				jrs_u32 uDefaultAlignment;  // 8
				jrs_u32 uMinAllocSize;		// 12
				jrs_u32 uMaxAllocSize;		// 16
				jrs_u32 uPad1;				// 20
				jrs_u32 uPad2;				// 24
				jrs_u32 uFlags;				// 28
			};

			op.idofheappool = pHeap->GetUniqueId();
			op.address = (jrs_u64)(pHeap->GetAddress());

			LVOpHeapInformation info;
			info.uSize = pHeap->GetSize();
			info.uDefaultAlignment = pHeap->GetDefaultAlignment();
			info.uMinAllocSize = (jrs_u32)pHeap->GetMinAllocationSize();
			info.uMaxAllocSize = (jrs_u32)pHeap->GetMaxAllocationSize();
			info.uPad1 = info.uPad2 = 0;
			info.uFlags = 0;
#ifdef MEMORYMANAGER_ENABLESENTINELCHECKS
			info.uFlags |= 1 << 7;
#endif
#ifdef MEMORYMANAGER_ENABLENAMEANDSTACKCHECKS
			info.uFlags |= 1 << 6;
#endif
			ContinuousLog_AddToBuffer(op, &info);

			if(m_bEnableContinuousDump)
			{
				const jrs_i8 *pOp = "Heap Create";
				if(op.type == eContLog_DestroyHeap)
				{
					pOp = "Heap Destroy";
				}
				else if(op.type == eContLog_ResizeHeap)
				{
					pOp = "Heap Resize";
				}

				sprintf(ContinuousOutputText, "%s; %s; 0x%llx; 0x%llx; 0x%x; 0x%x; 0x%x; 0x0; 0x0; 0x0; 0x0; 0x0; 0x0; 0x0\n",
					pOp,
					pHeap->GetName(),
					op.address,
					info.uSize,
					info.uDefaultAlignment,
					info.uMinAllocSize,
					info.uMaxAllocSize
					);
			}
		}
		else if(eType == eContLog_CreatePool || eType == eContLog_DestroyPool)
		{
			op.idofheappool = 0;
			struct LVOpPoolInformation
			{
				jrs_u64 uSize;				// 8
				jrs_u32 uDefaultAlignment;  // 12
				jrs_u32 uAllocSize;			// 16
				jrs_u32 uPad1;				// 20
				jrs_u32 uPad2;				// 24
				jrs_u32 uFlags;				// 28
			};

			op.idofheappool = (jrs_u16)pPool->GetUniqueId();
			op.address = (jrs_u64)pPool->GetAddress();

			LVOpPoolInformation info;
			info.uSize = pPool->GetSize();
			info.uDefaultAlignment = 0;
			info.uAllocSize = pPool->GetAllocationSize();
			info.uFlags = 0;
			info.uFlags |= pPool->HasNameAndCallstackTracing() ? 1 << 7 : 0;
			info.uFlags |= pPool->HasSentinels() ? 1 << 6 : 0;
			ContinuousLog_AddToBuffer(op, &info);

			if(m_bEnableContinuousDump)
			{
				const jrs_i8 *pOp = "Pool Create";
				if(op.type == eContLog_DestroyPool)
				{
					pOp = "Pool Destroy";
				}

				sprintf(ContinuousOutputText, "%s; %s$$%s; 0x%llx; 0x%llx; 0x%x; 0x0; 0x0; 0x0; 0x0; 0x0; 0x0; 0x0; 0x0; 0x0\n",
					pOp,
					pPool->GetName(), pPool->GetHeap()->GetName(),
					op.address,
					info.uSize,
					info.uAllocSize
					);
			}
		}
		else if(eType == eContLog_Marker)
		{
			jrs_i8 text[32];
			op.idofheappool = eContLog_Marker;
			jrs_u32 size = (jrs_u32)strlen((jrs_i8 *)pHeap);
			size = (size >= 31) ? 30 : size;
			memcpy(text, pHeap, size);
			text[size] = '\0';
			ContinuousLog_AddToBuffer(op, text);

			if(m_bEnableContinuousDump)
			{
				sprintf(ContinuousOutputText, "Marker; %s; 0x0; 0x0; 0x0; 0; 0; 0; 0; 0; 0; 0; 0; 0\n", text);
			}
		}
		else if(eType == eContLog_StartLogging || eType == eContLog_StopLogging)
		{
			op.idofheappool = 0;
			ContinuousLog_AddToBuffer(op, NULL);

			if(m_bEnableContinuousDump)
			{
				if(eType == eContLog_StartLogging)
				{
					bFileAppend = false;
					sprintf(ContinuousOutputText, "Logging Started; %d; 0x%llx; %d; %d; ; ; ; ; ; ; ; ; 0\n", 
#ifdef JRS64BIT
						1,
#else
						0,
#endif
						g_uBaseAddressOffsetCalculation, 
#ifdef JRSMEMORYMICROSOFTPLATFORMS
						0,
#else
						1,
#endif
						this->m_bResizeable ? 1 : 0
						);
				}
				else
				{
					m_ContThreadLock.Unlock();
					return;
				}
			}
		}
		else 
		{
			MemoryWarning(0, JRSMEMORYERROR_UNKNOWNWARNING, "Wrong type for ContinuousLogging_Operation.");
		}

		// Add the data
		// Write CSV file if need be
		if(m_bEnableContinuousDump && m_MemoryManagerFileOutput)
			m_MemoryManagerFileOutput(ContinuousOutputText, (int)strlen(ContinuousOutputText), m_ContinuousDumpFile, bFileAppend);

		// Unlock the continuous writes
		m_ContThreadLock.Unlock();
#endif
	}

	//  Description:
	//		Internal only.  This function add data to the internal ring buffer of operations to be transmitted.  This specific function deals with 
	//		the heap operations.
	//  See Also:
	//		
	//  Arguments:
	//		eType - Type of Logging operation.
	//		pHeap - Heap pointer.
	//		pPool - Pool pointer base.
	//		uMisc - Misc information.
	//  Return Value:
	//      Nothing
	//  Summary:	
	//		Reports any operations that occur on a specific heap.  These cover Allocations, Frees and Reallocs.  Reallocs may not always show.
	void cMemoryManager::ContinuousLogging_NIOperation(eContLog eType, cHeapNonIntrusive *pHeap, cPoolBase *pPool, jrs_u64 uMisc)
	{
#ifndef MEMORYMANAGER_MINIMAL
		// Only if active - we ignore the heap here and only care about if we should be logging or not
		if(!m_bELVContinuousGrab && !m_bEnableContinuousDump)
			return;

		// Lock the thread writes
		m_ContThreadLock.Lock();

		jrs_bool bFileAppend = TRUE;
		jrs_i8 ContinuousOutputText[512];

		sLVOperation op;
		op.type = (jrs_u8)eType;
		op.address = 0;
		op.sizeofopdata = 32;
		op.alignment = 0;
		op.extraInfo0 = op.extraInfo1 = op.extraInfo2 = op.extraInfo3 = 0;
		if(eType == eContLog_CreateHeap || eType == eContLog_DestroyHeap || eType == eContLog_ResizeHeap)
		{	
			struct LVOpHeapInformation
			{
				jrs_u64 uSize;				// 0
				jrs_u32 uDefaultAlignment;  // 8
				jrs_u32 uMinAllocSize;		// 12
				jrs_u32 uMaxAllocSize;		// 16
				jrs_u32 uPad1;				// 20
				jrs_u32 uPad2;				// 24
				jrs_u32 uFlags;				// 28
			};

			op.idofheappool = pHeap->GetUniqueId();
			op.address = (jrs_u64)(pHeap->GetAddress());

			LVOpHeapInformation info;
			info.uSize = pHeap->GetSize();
			info.uDefaultAlignment = (jrs_u32)pHeap->GetDefaultAlignment();
			info.uMinAllocSize = (jrs_u32)pHeap->GetMinAllocationSize();
			info.uMaxAllocSize = (jrs_u32)pHeap->GetMaxAllocationSize();
			info.uPad1 = info.uPad2 = 0;
			info.uFlags = 0;
			
			if(pHeap->IsMemoryTrackingEnabled())
				info.uFlags |= 1 << 7;

// #ifdef MEMORYMANAGER_ENABLENAMEANDSTACKCHECKS
// 			info.uFlags |= 1 << 6;
// #endif
			ContinuousLog_AddToBuffer(op, &info);

			if(m_bEnableContinuousDump)
			{
				const jrs_i8 *pOp = "Heap Create";
				if(op.type == eContLog_DestroyHeap)
				{
					pOp = "Heap Destroy";
				}
				else if(op.type == eContLog_ResizeHeap)
				{
					pOp = "Heap Resize";
				}

				sprintf(ContinuousOutputText, "%s; %s; 0x%llx; 0x%llx; 0x%x; 0x%x; 0x%x; 0x0; 0x0; 0x0; 0x0; 0x0; 0x0; 0x0\n",
